<?php







?>
<?php // preg_match('');
// '/qwe\/rty/' = 'qwe/rty' // символ \ - жкранирует седующий символ
// '/^qwe\/rty/' = ^ // символ начала данных
// '/qwe\/rty$/' = $ // символ конца данных
// '/qwe\/r.y/' = . // может идти любой символ кроме первода строки
// '/art[ioa]cle/' = // article, artocle, actacle
// '/a?article/' = ? // одно или ноль вхождений предыдущего символа
// '/a+rticle/' = + // одно или более вхождение предыдущего символа
// '/a*rticle/' = * // любое кол-о вхождений символа
// '/[a|b]ticle/' = | // или a или b
// '/[^qw]/' = [^] // логическое НЕ - все кроме q w
?>